package reg

import (
	"encoding/json" // Импортируем пакет для работы с JSON.
	"io"            // Импортируем пакет для работы с потоками ввода-вывода.
)

// Decode - универсальная функция для декодирования JSON-данных в структуру.
// Принимает в качестве аргумента тело запроса и возвращает структуру типа T.
// Если декодирование не удалось, возвращается ошибка.
func Decode[T any](body io.ReadCloser) (T, error) {
	var payload T // Создаем переменную payload типа T для хранения декодированных данных.

	//json.NewDecoder для декодирования данных из потока body.
	// Метод Decode преобразует JSON-данные в структуру типа T.
	if err := json.NewDecoder(body).Decode(&payload); err != nil {
		// Если произошла ошибка при декодировании, возвращаем пустую структуру и ошибку.
		return payload, err
	}

	// Возвращаем декодированные данные.
	// Если декодирование прошло успешно, payload содержит заполненную структуру.
	return payload, nil
}
