package reg

import (
	"github.com/go-playground/validator/v10" // Импортируем пакет для валидации структур.
)

// IsValid - функция для валидации структуры типа T.
// Использует пакет go-playground/validator для проверки обязательных полей и других правил валидации.
func IsValid[T any](payload T) error {
	// Создаем новый экземпляр валидатора.
	validate := validator.New()

	// Выполняем валидацию переданной структуры payload.
	// Метод Struct проверяет все поля структуры на соответствие правилам валидации,
	// указанным в тегах (например, `validate:"required"`).
	err := validate.Struct(payload)

	// Если валидация не прошла, метод Struct возвращает ошибку.
	// Возвращаем эту ошибку вызывающей стороне для дальнейшей обработки.
	return err
}
