package main

import (
	"fmt"      // Стандартный пакет для форматированного вывода.
	"net/http" // Стандартный пакет для работы с HTTP.
)

// main — точка входа в приложение.
func main() {
	// Создаем HTTP-приложение.
	App := App()

	// Настраиваем HTTP-сервер.
	server := http.Server{
		Addr:    ":8080", // Порт, на котором будет запущен сервер.
		Handler: App,     // Указываем маршрутизатор как обработчик запросов.
	}

	// Выводим сообщение о запуске сервера.
	fmt.Println("Listening on port 8080")

	// Запускаем сервер и обрабатываем входящие запросы.
	err := server.ListenAndServe()
	if err != nil {
		// Если произошла ошибка при запуске сервера, завершаем программу.
		return
	}
}
